# filter: انتخاب عناصر بر اساس شرط
# لیستی از اعداد تعریف می‌کنیم
nums = [1, 2, 3, 4, 5, 6]
# با استفاده از filter و لامبدا، اعداد زوج را انتخاب می‌کنیم
evens = list(filter(lambda x: x % 2 == 0, nums))
# نتیجه را چاپ می‌کنیم
print(evens)  # [2, 4, 6]

# فیلتر رشته‌های بلندتر از 3 حرف
# لیستی از رشته‌ها تعریف می‌کنیم
words = ["hi", "python", "java", "c"]
# رشته‌هایی با طول بیشتر از 3 را فیلتر می‌کنیم
long = list(filter(lambda w: len(w) > 3, words))
# نتیجه را چاپ می‌کنیم
print(long)  # ['python', 'java']
